---
type: Level
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# Level

`Autodesk.Revit.DB.Level` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `public static Level Create ( Document document , double elevation )` |
| Method | FindAssociatedPlanViewId | 2018 | `public ElementId FindAssociatedPlanViewId ()` |
| Method | GetNearestLevelId | — | `` |
| Method | GetPlaneReference | 2016 | `public Reference GetPlaneReference ()` |
| Property | Elevation | — | `public double Elevation { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | ProjectElevation | — | `public double ProjectElevation { get ; }` |